In [1]:
import duckdb
import pandas as pd

In [9]:
sql_query = '''
show tables
'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

                              name
0   bronze_parking_violation_codes
1        bronze_parking_violations
2                      first_model
3              gold_ticket_metrics
4            gold_vehicles_metrics
5          parking_violation_codes
6          parking_violations_2023
7                        ref_model
8   silver_parking_violation_codes
9        silver_parking_violations
10        silver_violation_tickets
11       silver_violation_vehicles

In [3]:
sql_query_import_1 = '''
CREATE OR REPLACE TABLE parking_violation_codes AS
SELECT * 
FROM read_csv_auto(
  'data/dof_parking_violation_codes.csv',
  normalize_names=True
  )
'''

sql_query_import_2 = '''
CREATE OR REPLACE TABLE parking_violations_2023 AS
SELECT *
FROM read_csv_auto(
  'data/parking_violations_issued_fiscal_year_2023_sample.csv',
  normalize_names=True
  )
'''

with duckdb.connect('data/ny_parking_violations.db') as con:
  con.sql(sql_query_import_1)
  con.sql(sql_query_import_2)

# when running using "with" will automatically close the db after executing.

In [4]:
sql_query = '''
SELECT * FROM parking_violation_codes LIMIT 5
'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

,code,definition,manhattan_96th_st_below,all_other_areas
0,1,FAILURE TO DISPLAY BUS PERMIT,515,515
1,2,NO OPERATOR NAM/ADD/PH DISPLAY,515,515
2,3,UNAUTHORIZED PASSENGER PICK-UP,515,515
3,4,BUS PARKING IN LOWER MANHATTAN,115,115
4,5,BUS LANE VIOLATION,250,250

In [6]:
sql_query = '''
SELECT * FROM ref_model LIMIT 5'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

   count_star()
0            97

In [8]:
sql_query = '''
SELECT * FROM bronze_parking_violations LIMIT 3'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

,summons_number,registration_state,plate_type,issue_date,violation_code,vehicle_body_type,vehicle_make,issuing_agency,vehicle_expiration_date,violation_location,violation_precinct,issuer_precinct,issuer_code,issuer_command,issuer_squad,violation_time,violation_county,violation_legal_code,vehicle_color,vehicle_year
0,9010912681,CA,PAS,2022-10-11,17,SUBN,FORD,T,20220788,50,50,50,365910,T201,D,0825A,BX,<NA>,BLACK,0
1,4858762841,NY,PAS,2023-08-21,36,4DSD,HONDA,V,0,<NA>,0,0,0,None,None,1036A,BK,True,GY,2003
2,4854645684,FL,PAS,2023-07-26,36,UT,BMW,V,0,<NA>,0,0,0,None,None,0126P,QN,True,WHI,2022

In [10]:
sql_query = '''
SELECT * FROM silver_parking_violations'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

,summons_number,registration_state,plate_type,issue_date,violation_code,vehicle_body_type,vehicle_make,issuing_agency,vehicle_expiration_date,violation_location,...,issuer_precinct,issuer_code,issuer_command,issuer_squad,violation_time,violation_county,violation_legal_code,vehicle_color,vehicle_year,is_manhattan_96th_st_below
0,9010912681,CA,PAS,2022-10-11,17,SUBN,FORD,T,20220788,50,...,50,365910,T201,D,0825A,BX,<NA>,BLACK,0,False
1,4858762841,NY,PAS,2023-08-21,36,4DSD,HONDA,V,0,<NA>,...,0,0,None,None,1036A,BK,True,GY,2003,False
2,4854645684,FL,PAS,2023-07-26,36,UT,BMW,V,0,<NA>,...,0,0,None,None,0126P,QN,True,WHI,2022,False
3,9044582707,NY,PAS,2023-04-10,21,SUBN,SUBAR,T,20231217,79,...,79,370326,T301,H,0924A,K,<NA>,GY,2017,False
4,9041503330,NY,PAS,2023-03-21,21,4DSD,CHEVR,T,20250320,26,...,26,373097,T103,C,1155A,NY,<NA>,BK,2018,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,9069356715,NY,COM,2023-08-07,21,VAN,FORD,T,20240831,30,...,30,361887,T103,II,1121A,NY,<NA>,YW,2016,False
99996,4802425399,NY,OMS,2022-09-25,36,SUBN,CHEVR,V,0,<NA>,...,0,0,None,None,0214P,BX,True,WH,2021,False
99997,4809109689,NY,ORG,2022-10-28,36,SUBN,NISSA,V,0,<NA>,...,0,0,None,None,0915A,MN,True,GY,2020,True
99998,4834558370,NY,PAS,2023-04-04,36,4DSD,LEXUS,V,0,<NA>,...,0,0,None,None,0416P,BK,True,BK,2002,False
99999,4837284462,NY,PAS,2023-04-21,36,4DSD,KIA,V,0,<NA>,...,0,0,None,None,0606P,ST,True,WH,2020,False

In [13]:
sql_query = '''
SELECT * FROM silver_violation_tickets LIMIT 3'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

,summons_number,issue_date,violation_code,is_manhattan_96th_st_below,issuing_agency,violation_location,violation_precinct,issuer_precinct,issuer_code,issuer_command,issuer_squad,violation_time,violation_county,violation_legal_code,fee_usd
0,9010912681,2022-10-11,17,False,T,50,50,50,365910,T201,D,0825A,BX,<NA>,95
1,4858762841,2023-08-21,36,False,V,<NA>,0,0,0,None,None,1036A,BK,True,50
2,4854645684,2023-07-26,36,False,V,<NA>,0,0,0,None,None,0126P,QN,True,50

In [14]:
sql_query = '''
SELECT * FROM gold_ticket_metrics'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

    violation_code  ticket_count  total_revenue_usd
0               36         37064          1853200.0
1                5          3477           869250.0
2               21         12149           789685.0
3               14          5047           580405.0
4               40          3902           448730.0
..             ...           ...                ...
71              23             1               60.0
72              41            18                0.0
73              94             1                NaN
74              95             4                NaN
75               0            14                NaN

[76 rows x 3 columns]

In [ ]:
sql_query = '''
SELECT * FROM gold_vehicle_metrics'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

   registration_state  ticket_count
0                  NJ          9258
1                  PA          3514
2                  FL          2414
3                  CT          1787
4                  GA           840
..                ...           ...
57                 SK             1
58                 PE             1
59                 NB             1
60                 AB             1
61                 BC             1

[62 rows x 2 columns]

In [16]:
sql_query = '''SELECT
 violation_code, 
 SUM(fee_usd) AS total_revenue_usd
FROM
  'silver_parking_violation_codes'
GROUP BY
   violation_code
HAVING 
  NOT(total_revenue_usd >=1)'''

with duckdb.connect('data/nyc_parking_violations.db') as con:
    display(con.sql(sql_query).df())

   violation_code  total_revenue_usd
0              41                0.0